package loop;

public class For {
    public static void main(String[] args) {
        /*
        * for문과 while문 비교
        *
        * for문은 초기화, 조건 검사, 반복 후 작업 등이 규칙적으로 한 줄에 모두 들어 있어 코드를 이해하기 더 쉬움
        * 특히 반복을 위해 값이 증가하는 카운터 변수를 다른 부분과 명확하게 구분 가능
        *
        * for (int i = 1; i <= endNum; i++)
        * 여기서는 변수 i가 카운터 변수다
        * 증가하면서 반복 횟수가 올라가고 또 변수 i를 사용해서 계속 반복할지 아니면 빠져나갈지 판단 가능
        * 이렇게 반복 횟수에 직접적인 영향을 주는 변수를 선언부터 값 증가, 조건식에 활용까지 for(초기식; 조건식; 증감식) 구조를 활용해서
        * 처리함
        * 덕분에 개발자는 루프 횟수와 관련된 코드와 나머지 코드를 명확하게 구분 가능
        *
        * 반면 while문은 변수 i를 선언하는 부분과 i++로 증가하는 부분이 기본 코드에 분산됨
        *
        * for문은 조건이 없으면 무한반복함
        */
    }
}
